{
  "blog": [
    {
      "title": "The Raspberry Pi Experience",
      "date": "02/11/2015",
      "content": [
        {
          "type": "text",
          "content": [
            "I received a Raspberry Pi over the holidays, and although I have had some ideas for what to do with it, I haven't taken",
            "the time until now to do them. There are plenty of other guides for how to  set up a Raspberry Pi into anything, I am",
            "not aiming to provide a guide, but simply what worked and did not work for me."
          ]
        },
        {
          "type": "text",
          "title": "Setting up Raspbian",
          "content": [
           "After several re-installs of NOOBs attempting to install all of the desired applications without errors (mysql is my enemy),",
           "I have a collection of commands/updates to perform to get my Pi up and running. These commands assume that Rasbian has been installed.",
           "<ol>",
           "  <li>If you are using wireless (like me) you first need to choose a static ip. It is easiest to set it up using the UI to",
           "    avoid mistakes with your internet connectivity. After connecting for the first time, you should see an entry that looks",
           "    familiar in wpa_supplicant.conf",
           "    <pre class='cmd'>",
           "      # /etc/wpa_supplicant/wpa_supplicant.conf",
           "      network={",
           "      tssid=\"Your Wireless SSID\"",
           "      psk=\"Your Password\"",
           "      proto=RSN",
           "      key_mgmt=WPA-PSK",
           "      pairwise=TKIP",
           "      auth_alg=OPEN",
           "      }</pre>",
           "  </li>",
           "  <li>At this point you should either know what you would like your static ip address to be or set it to stay at its current",
           "    ip permanently. Before we set up the device for a static IP, first let's get the data we need.",
           "    <br><br>",
           "    First get your netmask (and IP if you like from ifconfig)",
           "    <pre class='cmd'>",
           "      ifconfig</pre>",
           "    Then get your gateway (router IP) from netstat",
           "    <pre class='cmd'>",
           "      netstat -nr</pre>",
           "  </li>",
           "  <li>Now lets set up the device to always use this wireless connection at boot up by editing your interfaces",
           "    <pre class='cmd'>",
           "      sudo nano /etc/network/interfaces</pre>",
           "    Set your file to look similar to the file below",
           "    <pre class='cmd'>",
           "      # /etc/network/interfaces",
           "      auto wlan0",
           "      iface lo inet loopback",
           "      iface eth0 inet dhcp",
           "",
           "      allow-hotplug wlan0",
           "      iface wlan0 inet static",
           "      address xxx.xxx.xxx.xxx # this is your static ip for the pi",
           "      netmask xxx.xxx.xxx.xxx # netmask for your network",
           "      gateway xxx.xxx.xxx.xxx # IP of your router",
           "      wpa-conf /etc/wpa_supplicant/wpa_supplicant.conf",
           "      iface default inet dhcp</pre>",
           "  </li>",
           "  <li>Even though there is a static ip for the device. You will probably want to advertise the device on your",
           "    network so you can access by hostname instead of IP address typing raspberrypi.local is much easier than 192.168.1.123).",
           "    However, to do this we must download avahi-daemon",
           "    <pre class='cmd'>",
           "      sudo apt-get install avahi-daemon",
           "      sudo insserv avahi-daemon",
           "      sudo /etc/init.d/avahi-daemon restart</pre>",
           "  </li>",
           "  <li>Voila! Test it out, attempt to ping your Raspberry Pi from another device! If you are able to ping the IP",
           "    Address and not the hostname. Check your /etc/hosts file. Add an entry for the static ip address and the desired hostname. ",
           "    <strong>Note that the hostname WILL have .local appended.</strong>",
           "  </li>",
           "</ol>"
          ]
        }
      ]
    }
  ]
}
